src/cf/Enums/СостоянияДокументовМЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияДокументовМЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВходящийДокументЗарегистрирован</Name>
					<Comment>Для входящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументЗарегистрированГотовКОтправке</Name>
					<Comment>Для исходящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументОтправлен</Name>
					<Comment>Для исходящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПолучен</Name>
					<Comment>Для входящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсходящееУведомлениеЕщеНеОтправлено</Name>
					<Comment>Для входящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсходящийДокументЕщеНеОтправлен</Name>
					<Comment>Для исходящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсходящаяКвитанцияЕщеНеОтправлена</Name>
					<Comment>Для входящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаОтменена</Name>
					<Comment>Для исходящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленаКвитанция</Name>
					<Comment>Для входящих документов и уведомлений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленаКвитанцияОбОшибке</Name>
					<Comment>Для входящих документов и уведомлений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленоУведомление</Name>
					<Comment>Для входящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученаКвитанция</Name>
					<Comment>Для исходящих документов и уведомлений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученаКвитанцияОбОшибке</Name>
					<Comment>Для исходящих документов и уведомлений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоУведомление</Name>
					<Comment>Для исходящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданаИсходящаяКвитанция</Name>
					<Comment>Для входящих документов и уведомлений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданоИсходящееУведомление</Name>
					<Comment>для входящих документов</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СостоянияДокументовМЭДО/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Все возможные состояния входящего документа.
// 
// Возвращаемое значение:
//  СписокЗначений из ПеречислениеСсылка.СостоянияДокументовМЭДО - Состояния входящего документа
Функция СостоянияВходящегоДокумента() Экспорт
	
	Состояния = Новый СписокЗначений(); // СписокЗначений из ПеречислениеСсылка.СостоянияДокументовМЭДО
	Состояния.Добавить(ДокументПолучен);
	Состояния.Добавить(ВходящийДокументЗарегистрирован);
	Состояния.Добавить(ИсходящееУведомлениеЕщеНеОтправлено);
	Состояния.Добавить(ИсходящаяКвитанцияЕщеНеОтправлена);
	Состояния.Добавить(ОтправленаКвитанция);
	Состояния.Добавить(ОтправленаКвитанцияОбОшибке);
	Состояния.Добавить(ОтправленоУведомление);
	Состояния.Добавить(СозданаИсходящаяКвитанция);
	Состояния.Добавить(СозданоИсходящееУведомление);
	
	Возврат Состояния;
	
КонецФункции

// Все возможные состояния исходящего документа.
// 
// Возвращаемое значение:
//  СписокЗначений из ПеречислениеСсылка.СостоянияДокументовМЭДО - Состояния исходящего документа
Функция СостоянияИсходящегоДокумента() Экспорт
	
	Состояния = Новый СписокЗначений(); // СписокЗначений из ПеречислениеСсылка.СостоянияДокументовМЭДО
	Состояния.Добавить(ДокументЗарегистрированГотовКОтправке);
	Состояния.Добавить(ДокументОтправлен);
	Состояния.Добавить(ИсходящийДокументЕщеНеОтправлен);
	Состояния.Добавить(ОтправкаОтменена);
	Состояния.Добавить(ПолученаКвитанция);
	Состояния.Добавить(ПолученаКвитанцияОбОшибке);
	Состояния.Добавить(ПолученоУведомление);
	
	Возврат Состояния;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Массив-константа - состояния, являющиеся признаком к обработке входящих уведомлений.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.СостоянияДокументовМЭДО - Состояния к отправке
Функция СостоянияВходящиеУведомленияКОбработке() Экспорт

	Состояния = Новый Массив(); // СписокЗначений из ПеречислениеСсылка.СостоянияДокументовМЭДО
	Состояния.Добавить(ДокументОтправлен); // но ожидается уведомление.
	Состояния.Добавить(ПолученаКвитанция);
	Состояния.Добавить(ПолученоУведомление);
	
	Возврат Состояния;

КонецФункции

// Массив-константа - состояния, являющиеся признаком к обработке полученных входящих документов.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.СостоянияДокументовМЭДО - Состояния к отправке
Функция СостоянияВходящиеДокументыКОбработке() Экспорт
	
	Состояния = Новый Массив(); // СписокЗначений из ПеречислениеСсылка.СостоянияДокументовМЭДО
	Состояния.Добавить(ДокументПолучен);
	Состояния.Добавить(ОтправленаКвитанция);
	Состояния.Добавить(СозданаИсходящаяКвитанция);
	
	Возврат Состояния;
	
КонецФункции

#КонецОбласти

#КонецЕсли
